bookers2-debag/app/models/book.rb

SELECT "tags"."name" FROM "tags" INNER JOIN "book_tags" ON "tags"."id" = "book_tags"."tag_id" WHERE "book_tags"."book_id" = ?  [["book_id", 1]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "タグテスト"], ["created_at", "2022-11-06 10:57:38.773374"], ["updated_at", "2022-11-06 10:57:38.773374"]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "タグテスト"], ["LIMIT", 1]]
INSERT INTO "book_tags" ("book_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 1], ["tag_id", 1], ["created_at", "2022-11-06 10:57:38.793044"], ["updated_at", "2022-11-06 10:57:38.793044"]]
---
  def save_tags(savebook_tags)
    # 現在のユーザーの持っているskillを引っ張ってきている
    current_tags = self.tags.pluck(:name) unless self.tags.nil?
    # 今bookが持っているタグと今回保存されたものの差をすでにあるタグとする。古いタグは消す。
    old_tags = current_tags - savebook_tags
    # 今回保存されたものと現在の差を新しいタグとする。新しいタグは保存
    new_tags = savebook_tags - current_tags

    # Destroy old taggings:
    old_tags.each do |old_name|
      self.tags.delete Tag.find_by(name:old_name)
    end

    # Create new taggings:
    new_tags.each do |new_name|
      book_tag = Tag.find_or_create_by(name:new_name)
      # 配列に保存
      self.tags << book_tag