bookers2-debag/app/controllers/books_controller.rb

  def index
    @books = Book.all.order(params[:sort])
---
SELECT "books".* FROM "books" ORDER BY rate DESC

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    tag_list = params[:book][:tag_name].split(',')
    if @book.save
      @book.save_tags(tag_list)
---
INSERT INTO "books" ("title", "body", "user_id", "rate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "本のタイトル"], ["body", "感想"], ["user_id", 1], ["rate", 5.0], ["created_at", "2022-11-06 10:57:38.745356"], ["updated_at", "2022-11-06 10:57:38.745356"]]
INSERT INTO "book_tags" ("book_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 1], ["tag_id", 1], ["created_at", "2022-11-06 10:57:38.793044"], ["updated_at", "2022-11-06 10:57:38.793044"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "タグテスト"], ["created_at", "2022-11-06 10:57:38.773374"], ["updated_at", "2022-11-06 10:57:38.773374"]]